sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/third_party/exactle/ws-core/include/hci_defs.h
/* Command parameter lengths */
#define HCI_LEN_NOP                                  0

#define HCI_LEN_DISCONNECT                           3
#define HCI_LEN_READ_REMOTE_VER_INFO                 2

#define HCI_LEN_SET_EVENT_MASK                       8
#define HCI_LEN_SET_EVENT_MASK_PAGE2                 8
#define HCI_LEN_RESET                                0
#define HCI_LEN_READ_TX_PWR_LVL                      3
#define HCI_LEN_SET_CONTROLLER_TO_HOST_FC            1
#define HCI_LEN_HOST_BUFFER_SIZE                     8
#define HCI_LEN_HOST_NUM_CMPL_PKTS                   1

#define HCI_LEN_READ_LOCAL_VER_INFO                  0
#define HCI_LEN_READ_LOCAL_SUP_CMDS                  0
#define HCI_LEN_READ_LOCAL_SUP_FEAT                  0
#define HCI_LEN_READ_BUF_SIZE                        0
#define HCI_LEN_READ_BD_ADDR                         0

#define HCI_LEN_READ_RSSI                            2
#define HCI_LEN_READ_AUTH_PAYLOAD_TO                 2
#define HCI_LEN_WRITE_AUTH_PAYLOAD_TO                4

#define HCI_LEN_LE_SET_EVENT_MASK                    8
#define HCI_LEN_LE_READ_BUF_SIZE                     0
#define HCI_LEN_LE_READ_LOCAL_SUP_FEAT               0
#define HCI_LEN_LE_SET_RAND_ADDR                     6
#define HCI_LEN_LE_SET_ADV_PARAM                     15
#define HCI_LEN_LE_READ_ADV_TX_POWER                 0
#define HCI_LEN_LE_SET_ADV_DATA                      32
#define HCI_LEN_LE_SET_SCAN_RESP_DATA                32
#define HCI_LEN_LE_SET_ADV_ENABLE                    1
#define HCI_LEN_LE_SET_SCAN_PARAM                    7
#define HCI_LEN_LE_SET_SCAN_ENABLE                   2
#define HCI_LEN_LE_CREATE_CONN                       25
#define HCI_LEN_LE_CREATE_CONN_CANCEL                0
#define HCI_LEN_LE_READ_WHITE_LIST_SIZE              0
#define HCI_LEN_LE_CLEAR_WHITE_LIST                  0
#define HCI_LEN_LE_ADD_DEV_WHITE_LIST                7
#define HCI_LEN_LE_REMOVE_DEV_WHITE_LIST             7
#define HCI_LEN_LE_CONN_UPDATE                       14
#define HCI_LEN_LE_SET_HOST_CHAN_CLASS               5
#define HCI_LEN_LE_READ_CHAN_MAP                     2
#define HCI_LEN_LE_READ_REMOTE_FEAT                  2
#define HCI_LEN_LE_ENCRYPT                           32
#define HCI_LEN_LE_RAND                              0
#define HCI_LEN_LE_START_ENCRYPTION                  28
#define HCI_LEN_LE_LTK_REQ_REPL                      18
#define HCI_LEN_LE_LTK_REQ_NEG_REPL                  2
#define HCI_LEN_LE_READ_SUP_STATES                   0
#define HCI_LEN_LE_RECEIVER_TEST                     1
#define HCI_LEN_LE_TRANSMITTER_TEST                  3
#define HCI_LEN_LE_TEST_END                          0
/* New in version 4.1 */
#define HCI_LEN_LE_REM_CONN_PARAM_REP                14
#define HCI_LEN_LE_REM_CONN_PARAM_NEG_REP            3
/* New in version 4.2 */
#define HCI_LEN_LE_SET_DATA_LEN                      6
#define HCI_LEN_LE_READ_DEF_DATA_LEN                 0
#define HCI_LEN_LE_WRITE_DEF_DATA_LEN                4
#define HCI_LEN_LE_READ_LOCAL_P256_PUB_KEY           0
#define HCI_LEN_LE_GENERATE_DHKEY                    64
#define HCI_LEN_LE_ADD_DEV_RES_LIST                  39
#define HCI_LEN_LE_REMOVE_DEV_RES_LIST               7
#define HCI_LEN_LE_CLEAR_RES_LIST                    0
#define HCI_LEN_LE_READ_RES_LIST_SIZE                0
#define HCI_LEN_LE_READ_PEER_RES_ADDR                7
#define HCI_LEN_LE_READ_LOCAL_RES_ADDR               7
#define HCI_LEN_LE_SET_ADDR_RES_ENABLE               1
#define HCI_LEN_LE_SET_RES_PRIV_ADDR_TO              2
#define HCI_LEN_LE_READ_MAX_DATA_LEN                 0
/* New in version 5.0 */
#define HCI_LEN_LE_READ_PHY                          2
#define HCI_LEN_LE_SET_DEF_PHY                       3
#define HCI_LEN_LE_SET_PHY                           7
#define HCI_LEN_LE_ENHANCED_RECEIVER_TEST            3
#define HCI_LEN_LE_ENHANCED_TRANSMITTER_TEST         4
#define HCI_LEN_LE_SET_ADV_SET_RAND_ADDR             7
#define HCI_LEN_LE_SET_EXT_ADV_PARAM                 25
#define HCI_LEN_LE_SET_EXT_ADV_DATA(len)             (4 + (len))
#define HCI_LEN_LE_SET_EXT_SCAN_RESP_DATA(len)       (4 + (len))
#define HCI_LEN_LE_EXT_ADV_ENABLE(numSets)           (2 + (4 * (numSets)))
#define HCI_LEN_LE_READ_MAX_ADV_DATA_LEN             0
#define HCI_LEN_LE_READ_NUM_OF_SUP_ADV_SETS          0
#define HCI_LEN_LE_REMOVE_ADV_SET                    1
#define HCI_LEN_LE_CLEAR_ADV_SETS                    0
#define HCI_LEN_LE_SET_PER_ADV_PARAM                 7
#define HCI_LEN_LE_SET_PER_ADV_DATA(len)             (3 + (len))
#define HCI_LEN_LE_SET_PER_ADV_ENABLE                2
#define HCI_LEN_LE_SET_EXT_SCAN_PARAM(numPhys)       (3 + (5 * (numPhys)))
#define HCI_LEN_LE_SET_EXT_SCAN_ENABLE               6
#define HCI_LEN_LE_EXT_CREATE_CONN(numPhys)          (10 + (16 * (numPhys)))
#define HCI_LEN_LE_PER_ADV_CREATE_SYNC               14
#define HCI_LEN_LE_PER_ADV_CREATE_SYNC_CANCEL        0
#define HCI_LEN_LE_PER_ADV_TERMINATE_SYNC            2
#define HCI_LEN_LE_ADD_DEV_PER_ADV_LIST              8
#define HCI_LEN_LE_REMOVE_DEV_PER_ADV_LIST           8
#define HCI_LEN_LE_CLEAR_PER_ADV_LIST                0
#define HCI_LEN_LE_READ_PER_ADV_LIST_SIZE            0
#define HCI_LEN_LE_READ_TX_POWER                     0
#define HCI_LEN_LE_READ_RF_PATH_COMP                 0
#define HCI_LEN_LE_WRITE_RF_PATH_COMP                4
#define HCI_LEN_LE_SET_PRIVACY_MODE                  8

/* Events */
#define HCI_DISCONNECT_CMPL_EVT                      0x05
#define HCI_ENC_CHANGE_EVT                           0x08
#define HCI_READ_REMOTE_VER_INFO_CMPL_EVT            0x0C
#define HCI_CMD_CMPL_EVT                             0x0E
#define HCI_CMD_STATUS_EVT                           0x0F
#define HCI_HW_ERROR_EVT                             0x10
#define HCI_NUM_CMPL_PKTS_EVT                        0x13
#define HCI_DATA_BUF_OVERFLOW_EVT                    0x1A
#define HCI_ENC_KEY_REFRESH_CMPL_EVT                 0x30
#define HCI_LE_META_EVT                              0x3E
#define HCI_AUTH_PAYLOAD_TIMEOUT_EVT                 0x57
#define HCI_VENDOR_SPEC_EVT                          0xFF

/* LE Subevents */
#define HCI_LE_CONN_CMPL_EVT                         0x01
#define HCI_LE_ADV_REPORT_EVT                        0x02
#define HCI_LE_CONN_UPDATE_CMPL_EVT                  0x03
#define HCI_LE_READ_REMOTE_FEAT_CMPL_EVT             0x04
#define HCI_LE_LTK_REQ_EVT                           0x05
/* New in version 4.1 */
#define HCI_LE_REM_CONN_PARAM_REQ_EVT                0x06
/* New in version 4.2 */
#define HCI_LE_DATA_LEN_CHANGE_EVT                   0x07
#define HCI_LE_READ_LOCAL_P256_PUB_KEY_CMPL_EVT      0x08
#define HCI_LE_GENERATE_DHKEY_CMPL_EVT               0x09
#define HCI_LE_ENHANCED_CONN_CMPL_EVT                0x0A
#define HCI_LE_DIRECT_ADV_REPORT_EVT                 0x0B
/* New in version 5.0 */
#define HCI_LE_PHY_UPDATE_CMPL_EVT                   0x0C
#define HCI_LE_EXT_ADV_REPORT_EVT                    0x0D
#define HCI_LE_PER_ADV_SYNC_EST_EVT                  0x0E
#define HCI_LE_PER_ADV_REPORT_EVT                    0x0F
#define HCI_LE_PER_ADV_SYNC_LOST_EVT                 0x10
#define HCI_LE_SCAN_TIMEOUT_EVT                      0x11
#define HCI_LE_ADV_SET_TERM_EVT                      0x12
#define HCI_LE_SCAN_REQ_RCVD_EVT                     0x13
#define HCI_LE_CH_SEL_ALGO_EVT                       0x14

/* Event parameter lengths */
#define HCI_LEN_DISCONNECT_CMPL                      4       /*!< Disconnect event length. */
#define HCI_LEN_READ_REMOTE_VER_INFO_CMPL            8       /*!< Read remove version info complete event length. */
#define HCI_LEN_CMD_CMPL                             3       /*!< Command complete event length. */
#define HCI_LEN_CMD_STATUS                           4       /*!< Command status event length. */
#define HCI_LEN_HW_ERR                               1       /*!< Hardware error event length. */
#define HCI_LEN_NUM_CMPL_PKTS                        5       /*!< Number of completed packets event length. */
#define HCI_LEN_ENC_CHANGE                           4       /*!< Encryption change event length. */
#define HCI_LEN_ENC_KEY_REFRESH_CMPL                 3       /*!< Encryption key refresh complete event length. */
#define HCI_LEN_LE_CONN_CMPL                         19      /*!< Connection complete event length. */
#define HCI_LEN_LE_ADV_RPT_MIN                       12      /*!< Advertising report event minimum length. */
#define HCI_LEN_LE_CONN_UPDATE_CMPL                  10      /*!< Connection update complete event length. */
#define HCI_LEN_LE_READ_REMOTE_FEAT_CMPL             12      /*!< Read remote feature event length. */
#define HCI_LEN_LE_LTK_REQ                           13      /*!< LTK request event length. */
/* New in version 4.1 */
#define HCI_LEN_LE_REM_CONN_PARAM_REQ                11      /*!< Remote connection parameter event length. */
#define HCI_LEN_LE_DATA_LEN_CHANGE                   11      /*!< Data length change event length. */
#define HCI_LEN_LE_READ_PUB_KEY_CMPL                 66      /*!< Read local P256 public key compete event length. */
#define HCI_LEN_LE_GEN_DHKEY_CMPL                    34      /*!< Generate DH key complete event length. */
#define HCI_LEN_LE_ENHANCED_CONN_CMPL                31      /*!< Enhanced connection complete event length. */
#define HCI_LEN_LE_DIRECT_ADV_REPORT                 18      /*!< Direct advertising report event length. */
#define HCI_LEN_AUTH_PAYLOAD_TIMEOUT                 2       /*!< Authenticated payload timeout event length. */
/* New in version 5.0 */
#define HCI_LEN_LE_PHY_UPDATE_CMPL                   6       /*!< PHY update complete event length. */
#define HCI_LEN_LE_CH_SEL_ALGO                       4       /*!< Channel selection algorithm event length. */
#define HCI_LEN_LE_PHY_UPDATE_CMPL                   6       /*!< PHY update complete event length. */
#define HCI_LEN_LE_EXT_ADV_REPORT_MIN                26      /*!< Extended advertising report minimum length. */
#define HCI_LEN_LE_PER_ADV_SYNC_EST                  16      /*!< Periodic advertising sync established event length. */
#define HCI_LEN_LE_PER_ADV_REPORT                    8       /*!< Periodic advertising report event length. */
#define HCI_LEN_LE_PER_ADV_SYNC_LOST                 3       /*!< Periodic advertising sync lost event length. */
#define HCI_LEN_LE_SCAN_TIMEOUT                      1       /*!< Scan timeout event length. */
#define HCI_LEN_LE_ADV_SET_TERM                      6       /*!< Advertising set terminated event length. */
#define HCI_LEN_LE_SCAN_REQ_RCVD                     9       /*!< Scan request received event length. */

/* Supported commands */
#define HCI_SUP_DISCONNECT                           0x20    /* Byte 0 */
#define HCI_SUP_READ_REMOTE_VER_INFO                 0x80    /* Byte 2 */
#define HCI_SUP_SET_EVENT_MASK                       0x40    /* Byte 5 */
#define HCI_SUP_RESET                                0x80    /* Byte 5 */
#define HCI_SUP_READ_TX_PWR_LVL                      0x04    /* Byte 10 */
#define HCI_SUP_READ_LOCAL_VER_INFO                  0x08    /* Byte 14 */
#define HCI_SUP_READ_LOCAL_SUP_FEAT                  0x20    /* Byte 14 */
#define HCI_SUP_READ_BD_ADDR                         0x02    /* Byte 15 */
#define HCI_SUP_READ_RSSI                            0x20    /* Byte 15 */
#define HCI_SUP_SET_EVENT_MASK_PAGE2                 0x04    /* Byte 22 */
#define HCI_SUP_LE_SET_EVENT_MASK                    0x01    /* Byte 25 */
#define HCI_SUP_LE_READ_BUF_SIZE                     0x02    /* Byte 25 */
#define HCI_SUP_LE_READ_LOCAL_SUP_FEAT               0x04    /* Byte 25 */
#define HCI_SUP_LE_SET_RAND_ADDR                     0x10    /* Byte 25 */
#define HCI_SUP_LE_SET_ADV_PARAM                     0x20    /* Byte 25 */
#define HCI_SUP_LE_READ_ADV_TX_POWER                 0x40    /* Byte 25 */
#define HCI_SUP_LE_SET_ADV_DATA                      0x80    /* Byte 25 */
#define HCI_SUP_LE_SET_SCAN_RESP_DATA                0x01    /* Byte 26 */
#define HCI_SUP_LE_SET_ADV_ENABLE                    0x02    /* Byte 26 */
#define HCI_SUP_LE_SET_SCAN_PARAM                    0x04    /* Byte 26 */
#define HCI_SUP_LE_SET_SCAN_ENABLE                   0x08    /* Byte 26 */
#define HCI_SUP_LE_CREATE_CONN                       0x10    /* Byte 26 */
#define HCI_SUP_LE_CREATE_CONN_CANCEL                0x20    /* Byte 26 */
#define HCI_SUP_LE_READ_WHITE_LIST_SIZE              0x40    /* Byte 26 */
#define HCI_SUP_LE_CLEAR_WHITE_LIST                  0x80    /* Byte 26 */
#define HCI_SUP_LE_ADD_DEV_WHITE_LIST                0x01    /* Byte 27 */
#define HCI_SUP_LE_REMOVE_DEV_WHITE_LIST             0x02    /* Byte 27 */
#define HCI_SUP_LE_CONN_UPDATE                       0x04    /* Byte 27 */
#define HCI_SUP_LE_SET_HOST_CHAN_CLASS               0x08    /* Byte 27 */
#define HCI_SUP_LE_READ_CHAN_MAP                     0x10    /* Byte 27 */
#define HCI_SUP_LE_READ_REMOTE_FEAT                  0x20    /* Byte 27 */
#define HCI_SUP_LE_ENCRYPT                           0x40    /* Byte 27 */
#define HCI_SUP_LE_RAND                              0x80    /* Byte 27 */
#define HCI_SUP_LE_START_ENCRYPTION                  0x01    /* Byte 28 */
#define HCI_SUP_LE_LTK_REQ_REPL                      0x02    /* Byte 28 */
#define HCI_SUP_LE_LTK_REQ_NEG_REPL                  0x04    /* Byte 28 */
#define HCI_SUP_LE_READ_SUP_STATES                   0x08    /* Byte 28 */
#define HCI_SUP_LE_RECEIVER_TEST                     0x10    /* Byte 28 */
#define HCI_SUP_LE_TRANSMITTER_TEST                  0x20    /* Byte 28 */
#define HCI_SUP_LE_TEST_END                          0x40    /* Byte 28 */
#define HCI_SUP_READ_AUTH_PAYLOAD_TO                 0x10    /* Byte 32 */
#define HCI_SUP_WRITE_AUTH_PAYLOAD_TO                0x20    /* Byte 32 */
/* New in version 4.1 */
#define HCI_SUP_LE_REM_CONN_PARAM_REQ_REPL           0x10    /* Byte 33 */
#define HCI_SUP_LE_REM_CONN_PARAM_REQ_NEG_REPL       0x20    /* Byte 33 */
/* New in version 4.2 */
#define HCI_SUP_LE_SET_DATA_LEN                      0x40    /* Byte 33 */
#define HCI_SUP_LE_READ_DEF_DATA_LEN                 0x80    /* Byte 33 */
#define HCI_SUP_LE_WRITE_DEF_DATA_LEN                0x01    /* Byte 34 */
#define HCI_SUP_LE_READ_LOCAL_P256_PUB_KEY           0x02    /* Byte 34 */
#define HCI_SUP_LE_GENERATE_DHKEY                    0x04    /* Byte 34 */
#define HCI_SUP_LE_ADD_DEV_RES_LIST_EVT              0x08    /* Byte 34 */
#define HCI_SUP_LE_REMOVE_DEV_RES_LIST               0x10    /* Byte 34 */
#define HCI_SUP_LE_CLEAR_RES_LIST                    0x20    /* Byte 34 */
#define HCI_SUP_LE_READ_RES_LIST_SIZE                0x40    /* Byte 34 */
#define HCI_SUP_LE_READ_PEER_RES_ADDR                0x80    /* Byte 34 */
#define HCI_SUP_LE_READ_LOCAL_RES_ADDR               0x01    /* Byte 35 */
#define HCI_SUP_LE_SET_ADDR_RES_ENABLE               0x02    /* Byte 35 */
#define HCI_SUP_LE_SET_RES_PRIV_ADDR_TO              0x04    /* Byte 35 */
#define HCI_SUP_LE_READ_MAX_DATA_LEN                 0x08    /* Byte 35 */
/* New in version 5.0 */
#define HCI_SUP_LE_READ_PHY                          0x10    /* Byte 35 */
#define HCI_SUP_LE_SET_DEF_PHY                       0x20    /* Byte 35 */
#define HCI_SUP_LE_SET_PHY                           0x40    /* Byte 35 */
#define HCI_SUP_LE_ENHANCED_RECEIVER_TEST            0x80    /* Byte 35 */
#define HCI_SUP_LE_ENHANCED_TRANSMITTER_TEST         0x01    /* Byte 36 */
#define HCI_SUP_LE_SET_ADV_SET_RAND_ADDR             0x02    /* Byte 36 */
#define HCI_SUP_LE_SET_EXT_ADV_PARAM                 0x04    /* Byte 36 */
#define HCI_SUP_LE_SET_EXT_ADV_DATA                  0x08    /* Byte 36 */
#define HCI_SUP_LE_SET_EXT_SCAN_RESP_DATA            0x10    /* Byte 36 */
#define HCI_SUP_LE_SET_EXT_ADV_ENABLE                0x20    /* Byte 36 */
#define HCI_SUP_LE_READ_MAX_ADV_DATA_LEN             0x40    /* Byte 36 */
#define HCI_SUP_LE_READ_NUM_OF_SUP_ADV_SETS          0x80    /* Byte 36 */
#define HCI_SUP_LE_REMOVE_ADV_SET                    0x01    /* Byte 37 */
#define HCI_SUP_LE_CLEAR_ADV_SETS                    0x02    /* Byte 37 */
#define HCI_SUP_LE_SET_PER_ADV_PARAM                 0x04    /* Byte 37 */
#define HCI_SUP_LE_SET_PER_ADV_DATA                  0x08    /* Byte 37 */
#define HCI_SUP_LE_SET_PER_ADV_ENABLE                0x10    /* Byte 37 */
#define HCI_SUP_LE_SET_EXT_SCAN_PARAM                0x20    /* Byte 37 */
#define HCI_SUP_LE_SET_EXT_SCAN_ENABLE               0x40    /* Byte 37 */
#define HCI_SUP_LE_EXT_CREATE_CONN                   0x80    /* Byte 37 */
#define HCI_SUP_LE_PER_ADV_CREATE_SYNC               0x01    /* Byte 38 */
#define HCI_SUP_LE_PER_ADV_CREATE_SYNC_CANCEL        0x02    /* Byte 38 */
#define HCI_SUP_LE_PER_ADV_TERMINATE_SYNC            0x04    /* Byte 38 */
#define HCI_SUP_LE_ADD_DEV_PER_ADV_LIST              0x08    /* Byte 38 */
#define HCI_SUP_LE_REMOVE_DEV_PER_ADV_LIST           0x10    /* Byte 38 */
#define HCI_SUP_LE_CLEAR_PER_ADV_LIST                0x20    /* Byte 38 */
#define HCI_SUP_LE_READ_PER_ADV_LIST_SIZE            0x40    /* Byte 38 */
#define HCI_SUP_LE_READ_TX_POWER                     0x80    /* Byte 38 */
#define HCI_SUP_LE_READ_RF_PATH_COMP                 0x01    /* Byte 39 */
#define HCI_SUP_LE_WRITE_RF_PATH_COMP                0x02    /* Byte 39 */
#define HCI_SUP_LE_SET_PRIVACY_MODE                  0x04    /* Byte 39 */
#define HCI_SUP_LE_SET_MIN_NUM_OF_USED_CH            0x08    /* Byte 39 */

/* Event mask */
#define HCI_EVT_MASK_DISCONNECT_CMPL                 0x10    /* Byte 0 */
#define HCI_EVT_MASK_ENC_CHANGE                      0x80    /* Byte 0 */
#define HCI_EVT_MASK_READ_REMOTE_VER_INFO_CMPL       0x08    /* Byte 1 */
#define HCI_EVT_MASK_HW_ERROR                        0x80    /* Byte 1 */
#define HCI_EVT_MASK_DATA_BUF_OVERFLOW               0x02    /* Byte 3 */
#define HCI_EVT_MASK_ENC_KEY_REFRESH_CMPL            0x80    /* Byte 5 */
#define HCI_EVT_MASK_LE_META                         0x20    /* Byte 7 */

