sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/third_party/exactle/ws-core/include/hci_defs.h
/*! Extended advertising report event seconday PHY values */
#define HCI_ADV_RPT_PHY_SEC_NONE                     0x00    /*!< No packets on seconday advertising channel */
#define HCI_ADV_RPT_PHY_SEC_LE_1M                    0x01    /*!< Advertiser PHY is LE 1M */
#define HCI_ADV_RPT_PHY_SEC_LE_2M                    0x02    /*!< Advertiser PHY is LE 2M */
#define HCI_ADV_RPT_PHY_SEC_LE_CODED                 0x03    /*!< Advertiser PHY is LE Coded */

/*! Channel selection algorithm used */
#define HCI_CH_SEL_ALGO_1                            0x00   /*!< LE channel selection algorithm #1 used */
#define HCI_CH_SEL_ALGO_2                            0x01   /*!< LE channel selection algorithm #2 used */

/*! Minimum number of used channels */
#define HCI_MIN_NUM_OF_USED_CHAN                     8      /*!< Minimum number of used channels */

/* Misc command parameters */
#define HCI_READ_TX_PWR_CURRENT                      0       /*!< Read current tx power */
#define HCI_READ_TX_PWR_MAX                          1       /*!< Read maximum tx power */
#define HCI_TX_PWR_MIN                               -30     /*!< Minimum tx power dBm */
#define HCI_TX_PWR_MAX                               20      /*!< Maximum tx power dBm */
#define HCI_TX_PWR_NO_PREFERENCE                     127     /*!< Tx power no preference */
#define HCI_VERSION                                  6       /*!< HCI specification version */
#define HCI_RSSI_MIN                                 -127    /*!< Minimum RSSI dBm */
#define HCI_RSSI_MAX                                 20      /*!< Maximum RSSI dBm */
#define HCI_ADDR_TYPE_PUBLIC                         0       /*!< Public device address */
#define HCI_ADDR_TYPE_RANDOM                         1       /*!< Random device address */
#define HCI_ADDR_TYPE_PUBLIC_IDENTITY                2       /*!< Public identity address */
#define HCI_ADDR_TYPE_RANDOM_IDENTITY                3       /*!< Random identity address */
#define HCI_ADDR_TYPE_ANONYMOUS                      0xFF    /*!< Anonymous device address */
#define HCI_FILT_NONE                                0       /*!< Accept all advertising packets */
#define HCI_FILT_WHITE_LIST                          1       /*!< Accept from While List only */
#define HCI_FILT_RES_INIT                            2       /*!< Accept directed advertisements with RPAs */
#define HCI_FILT_WHITE_LIST_RES_INIT                 3       /*!< Accept from White List or directed advertisements with RPAs */
#define HCI_FILT_PER_ADV_PARAM                       0       /*!< Listen to advertiser specified by create sync command parameters */
#define HCI_FILT_PER_ADV_LIST                        1       /*!< Listen to advertiser from Periodic Advertiser List only */
#define HCI_ROLE_MASTER                              0       /*!< Role is master */
#define HCI_ROLE_SLAVE                               1       /*!< Role is slave */
#define HCI_PRIV_MODE_NETWORK                        0x00    /*!< Network privacy mode (default) */
#define HCI_PRIV_MODE_DEVICE                         0x01    /*!< Device privacy mode */

/*! PHY types */
#define HCI_PHY_NONE                                 0x00    /*! No selected PHY */
#define HCI_PHY_LE_1M_BIT                            (1<<0)  /*! LE 1M PHY */
#define HCI_PHY_LE_2M_BIT                            (1<<1)  /*! LE 2M PHY */
#define HCI_PHY_LE_CODED_BIT                         (1<<2)  /*! LE Coded PHY */

/*! All PHYs preference */
#define HCI_ALL_PHY_ALL_PREFERENCES                  0x00    /*! All PHY preferences */
#define HCI_ALL_PHY_TX_PREFERENCE_BIT                (1<<0)  /*! Tx PHY preference */
#define HCI_ALL_PHY_RX_PREFERENCE_BIT                (1<<1)  /*! Rx PHY preference */

/*! PHY options */
#define HCI_PHY_OPTIONS_NONE                         0x00    /*! No preferences */

/* Parameter lengths */
#define HCI_EVT_MASK_LEN                             8       /*!< Length of event mask byte array */
#define HCI_EVT_MASK_PAGE_2_LEN                      8       /*!< Length of event mask page 2 byte array */
#define HCI_LE_EVT_MASK_LEN                          8       /*!< Length of LE event mask byte array */
#define HCI_FEAT_LEN                                 8       /*!< Length of features byte array */
#define HCI_ADV_DATA_LEN                             31      /*!< Length of advertising data */
#define HCI_SCAN_DATA_LEN                            31      /*!< Length of scan response data */
#define HCI_EXT_ADV_DATA_LEN                         251     /*!< Length of extended advertising data */
#define HCI_PER_ADV_DATA_LEN                         252     /*!< Length of periodic advertising data */
#define HCI_EXT_ADV_RPT_DATA_LEN                     229     /*!< Length of extended advertising report data */
#define HCI_PER_ADV_RPT_DATA_LEN                     248     /*!< Length of periodic advertising report data */
#define HCI_CHAN_MAP_LEN                             5       /*!< Length of channel map byte array */
#define HCI_KEY_LEN                                  16      /*!< Length of encryption key */
#define HCI_ENCRYPT_DATA_LEN                         16      /*!< Length of data used in encryption */
#define HCI_RAND_LEN                                 8       /*!< Length of random number */
#define HCI_LE_STATES_LEN                            8       /*!< Length of LE states byte array */
#define HCI_P256_KEY_LEN                             64      /*!< Length of P256 key */
#define HCI_DH_KEY_LEN                               32      /*!< Length of DH Key */

#define HCI_EXT_ADV_RPT_DATA_LEN_OFFSET              23      /*!< Length field offset of extended advertising report data */
#define HCI_PER_ADV_RPT_DATA_LEN_OFFSET              5       /*!< Length field offset of periodic advertising report data */

/* Company ID */
#define HCI_ID_ARM                                   0x005F  /*! ARM Ltd. company ID */

/* Manufacturer location in Local version */
#define HCI_LOCAL_VER_MANUFACTURER_POS              4

#ifdef __cplusplus
};
#endif

#endif /* HCI_DEFS_H */
